Repository: juniorlemos/AgroApi
Catalog: src/Shared/Agro.Exceptions/ResourceMessagesException.*.resx
Languages: pt_br

source: Animal Exit not found.
pt_br: Saida de Animais nao encontrado.

# DEPARTURE_DATA_REQUIRED
source: The departure date must be provided.
pt_br: A data de saída deve ser informada.

# QUANTITY_EXCEEDS_AVAILABLE_SOURCE_ANIMALS
source: Quantity exceeds available animals in source UEP.
pt_br: Quantidade excede animais disponíveis na UEP.

source: Exploration Unit not found.
pt_br: Unidade de Exploração não encontrada.

# ORIGIN_UEP_CANNOT_BE_DESTINATION_UEP
source: The origin UEP must be different from the destination UEP.
pt_br: O UEP de origem deve ser diferente do UEP de destino.

# PROPERTY_CODE_REQUIRED
source: The property code must be provided.
pt_br: O código da propriedade deve ser informado.

# QUANTITY_OF_ANIMALS_REQUIRED
source: The quantity of animals must be provided.
pt_br: A quantidade de animais deve ser informada.

# SPECIES_CODE_REQUIRED
source: The species code must be provided.
pt_br: O código da espécie deve ser informado.

source: The species does not exist.
pt_br: A espécie não existe.

# UEP_DEPARTURE_REQUIRED
source: The departure UEP code must be provided
pt_br: O código da UEP de saída deve ser informado.

# UEP_ORIGIN_REQUIRED
source: The origin UEP code must be provided.
pt_br: O código da UEP de origem deve ser informado.

source: Unknown error.
pt_br: Erro desconhecido.

# ANIMALS_MUST_BE_ABOVE_ZERO
source: The number of animals must be greater than zero.
pt_br: A quantidade de animais deve ser maior que zero.

source: Exploration unit cannot be deleted with animals
pt_br: Não é possível excluir a unidade de exploração enquanto houver animais vinculados.
